test/echo-bzt.yaml
# bzt gpu-api-bzt.yaml
---
execution:
- concurrency: 100
  ramp-up: 1s
  hold-for: 10m
  scenario: echo-api-onepod
- concurrency: 1000
  ramp-up: 1s
  hold-for: 10m
  scenario: echo-api

scenarios:
  echo-api-onepod:
    think-time: 0
    requests:
    # - https://<alb>.ap-northeast-2.elb.amazonaws.com/
    - http://34.111.72.78/
  echo-api:
    think-time: 0
    requests:
    # - https://<alb>.ap-northeast-2.elb.amazonaws.com/
    - http://34.111.72.78/